/**
 * Website Texts
 * @namespace websiteTexts
 * @property {homepage} HOME PAGE text
 * @property {aboutpage} ABOUT PAGE text
 *
 */
const websiteTexts = {
  homepage: {
    header: {
      title: 'Создаем сложные веб-проекты, мобильные приложения и дизайн решения',
      subtitle: 'Мы - крутая и амбициозная команда IT специалистов. За плечами у каждого накоплен серьезный опыт разработки и поддержки систем для автоматизации бизнеса и бизнеса-процессов. Это позволяет нам разрабатывать качественные, производительные и надежные системы.',
    },
    scope: {
      ui: {
        title: 'UI/UX дизайн',
        description: 'Детально проектируем и визуализируем интерфейсы для сайтов, мобильных приложений и сервисов любой сложности. Проводим аналитику и аудит уже готовых продуктов. Создаём индивидуальные концепции.',
      },
      front: {
        title: 'Front-end разработка',
        description: 'Разрабатываем веб-приложения и веб-сервисы с использованием React, Redux, Sass или Less. Для сборки проекта используем Webpack. Основной язык программирования во front–end JavaScript',
      },
      back: {
        title: 'Back-end разработка',
        description: 'Back–end пишем на Python, Golang и NodeJS. Менеджмент репозиториев, CI/CD и баг–трекер GitLab. Автоматизация развертывания Docker',
      },
      mobile: {
        title: 'Мобильная разработка',
        description: 'Разрабатываем приложения под iOS и Android для мобильных устройств. Пишем на Kotlin и Swift, иногда React Native. Делаем приложения удобными и простыми для пользователя, независимо от сложности проекта.',
      },
      design: {
        title: 'Графический дизайн и анимиция',
        description: 'Делаем чистый и уникальный дизайн. Создаем анимационные ролики которые просто, быстро и понятно  доставят идею аудитории. Поможем создать логотип, фирменный стиль, презентацию, дизайн печатной продукции или баннеров, рекламы или инфографики.',
      },
      support: {
        title: 'Поддержка и продвижение',
        description: 'Осуществляем техническую поддержку после запуска проекта. Помогаем в продвижении проектов по всем направлениям: контекстная реклама, SEO: поисковая оптимизация,\n' +
          'таргетированная реклама, аналитика, а также продвижение в сети Telegram',
      },
    },
  },

  aboutpage: {
    header: {
      title: 'Endpoint - digital-агенство',
      subtitle: 'Мы - крутая и амбициозная команда IT специалистов. За плечами у каждого накоплен серьезный опыт разработки и поддержки систем для автоматизации бизнеса и бизнеса-процессов. Это позволяет нам разрабатывать качественные, производительные и надежные системы.',
      secondSubtitle: 'Детальное исследование, интуитивно понятный дизайн и высокое качество разработки позволяют нам отвечать на все запросы клиента и создавать востребованный продукт.',
    },
    aboutService: {
      productDesign: {
        title: 'Product Design',
        description: 'Мы создаем опыт, который обеспечивает ценность для пользователей и предприятий. Мы делаем дизайн интерфейса, пользовательский опыт, дизайн веб-сайта, дизайн мобильных приложений (iOS и Android), создание пользовательских потоков, каркас и прототипирование, визуальный дизайн.',
      },
      productDevelopment: {
        title: 'Product Development',
        description: 'Объединяя лучшие практики UI & UX со стратегическим процессом брендинга, мы разрабатываем вдохновляющие продукты, которые соответствуют целям и потребностям вашей целевой аудитории.',
      },
      marketing: {
        title: 'Интернет-маркетинг',
        description: 'Поможем продвинуть ваши услуги или продукт в интернете. Оптимизируем сайт под поисковые сервисы, запустим таргетированную рекламу, подготовим аналитику и займемся SMM для вашего продукта или сервиса',
      },
    },
  },
};

export default websiteTexts;
