/**
 * Website Texts
 * @namespace websiteTexts
 * @property {homepage} HOME PAGE text
 * @property {aboutpage} ABOUT PAGE text
 *
 */
const websiteTexts = {
  homepage: {
    header: {
      title: 'Создаем сложные веб-проекты, мобильные приложения и дизайн решения',
      subtitle: 'Мы - крутая и амбициозная команда IT специалистов. За плечами у каждого накоплен серьезный опыт разработки и поддержки систем для автоматизации бизнеса и бизнес-процессов. Это позволяет нам разрабатывать качественные, производительные и надежные системы',
    },
    scope: {
      ui: {
        title: 'UI/UX дизайн',
        description: 'Детально проектируем и визуализируем интерфейсы для сайтов, мобильных приложений и сервисов любой сложности. Проводим аналитику и аудит уже готовых продуктов. Создаём индивидуальные концепции',
      },
      front: {
        title: 'Front-end разработка',
        description: 'Разрабатываем веб-приложения и веб-сервисы с использованием React, Redux, Sass или Less. Для сборки проекта используем Webpack. Основной язык программирования во front–end JavaScript',
      },
      back: {
        title: 'Back-end разработка',
        description: 'Back–end пишем на Python, Golang и NodeJS. Менеджмент репозиториев, CI/CD и баг–трекер GitLab. Автоматизация развертывания Docker',
      },
      mobile: {
        title: 'Мобильная разработка',
        description: 'Разрабатываем приложения под iOS и Android для мобильных устройств. Пишем на Kotlin и Swift, иногда React Native. Делаем приложения удобными и простыми для пользователя, независимо от сложности проекта',
      },
      design: {
        title: 'Графический дизайн и анимация',
        description: 'Делаем чистый и уникальный дизайн. Создаем анимационные ролики которые просто, быстро и понятно доставят идею аудитории. Поможем создать логотип, фирменный стиль, презентацию или то что нужно',
      },
      support: {
        title: 'Поддержка и продвижение',
        description: 'Осуществляем техническую поддержку после запуска проекта. Помогаем в продвижении проектов по всем направлениям: контекстная реклама, SEO: поисковая оптимизация, таргетированная реклама, аналитика, а также продвижение в сети Telegram',
      },
    },
  },

  aboutpage: {
    header: {
      title: 'Endpoint - digital-агенство',
      subtitle: 'Мы - крутая и амбициозная команда IT специалистов. За плечами у каждого накоплен серьезный опыт разработки и поддержки систем для автоматизации бизнеса и бизнеса-процессов. Это позволяет нам разрабатывать качественные, производительные и надежные системы.',
      secondSubtitle: 'Детальное исследование, интуитивно понятный дизайн и высокое качество разработки позволяют нам отвечать на все запросы клиента и создавать востребованный продукт.',
    },
    aboutService: {
      productDesign: {
        title: 'Product Design',
        description: 'Разработаем детализированный, интерактивный прототип пользовательского интерфейса, максимально приближенный к реальному приложению. Мы создаем дизайн, который обеспечивает ценность и удобство для пользователей. Разрабатываем макеты страниц, составляем визуальную концепцию, подбираем стили, цвета, шрифты. В итоге получаем продуманный дизайн продукта, готовый к разработке: с навигацией, сценариями и визуальной коммуникацией',
      },
      productDevelopment: {
        title: 'Product Development',
        description: 'Создаём многопользовательские сервисы и приложения, справляющиеся с высокой нагрузкой, сложной логикой, разрабатываем документированное API для мобильных приложений. Делаем telegram боты любого уровня сложности. Мы используем самые современные стандарты и технологии:',
      },
      marketing: {
        title: 'Интернет-маркетинг',
        description: 'Поможем продвинуть ваши услуги или продукт в интернете. Контекстная реклама, SEO: поисковая оптимизация, таргетированная реклама, контент-маркетинг, продвижение в сети Telegram, аналитика',
      },
    },
  },
};

export default websiteTexts;
